# Kaggle Task - Titanic
### Dale Sandbox
Creating a code to test out the import and investigation of the Titanic Kaggle data

**Coding Steps**
1. Exploratory data analysis
    1. Summary statistics for each numeric and categorical independent variable
    2. Overall summary statistics for the dependent variable
    3. Cross-tab analysis of independent vs. dependent
    4. Plot some charts / band up variables as appropriate
2. Prep data for model
    1. Band up variables that require banding
    2. Filter to include only independent and dependent var
3. Train model
    1. Simple logistic regression with variables proposed
    2. Generate predictions on the trianing dataset
    3. Calculate accuracy

**Additional Ideas**
1. Using fancier plotting for the exploratory analysis
2. Missing handling
3. Enhancement of the modelling functions
4. Feature engineering
    1. Turn all variables into numeric features
    2. Enhanced banding
    3. Normalise all the variables
    4. Combining variables (can we work out who is in the family)
5. Additional modelling techniques

**0. Packages & Data Import**

In [5]:
import pandas as pd
pd.options.mode.chained_assignment = None  # default='warn'
import numpy as np
import statsmodels.api as sm
import plotly.express as px

pd.set_option('display.max_rows', 1000)

In [10]:
input_train = pd.read_csv('Data/train.csv')
input_train.head(100)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.00,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.00,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.00,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.00,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.00,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.00,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.00,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.00,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.00,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.00,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.00,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.00,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.00,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.00,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.00,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.00,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.00,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.00,0,0,A./5. 2152,8.0500,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.00,2,0,345764,18.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,1,0,2651,11.2417,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.00,1,0,7546,9.4750,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.00,1,0,11668,21.0000,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.00,0,0,330958,7.8792,NaN,Q
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.00,1,0,349237,17.8000,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.00,4,1,3101295,39.6875,NaN,S
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.00,0,0,A/4. 39886,7.8000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.00,1,0,PC 17572,76.7292,D33,C
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29.00,1,0,2926,26.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.00,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
56,57,1,2,"Rugg, Miss. Emily",female,21.00,0,0,C.A. 31026,10.5000,NaN,S
57,58,0,3,"Novel, Mr. Mansouer",male,28.50,0,0,2697,7.2292,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.00,1,2,C.A. 34651,27.7500,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.00,5,2,CA 2144,46.9000,NaN,S
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.00,0,0,2669,7.2292,NaN,C
61,62,1,1,"Icard, Miss. Amelie",female,38.00,0,0,113572,80.0000,B28,NaN
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.00,1,0,36973,83.4750,C83,S
63,64,0,3,"Skoog, Master. Harald",male,4.00,3,2,347088,27.9000,NaN,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.00,0,0,C.A. 29395,10.5000,F33,S
67,68,0,3,"Crease, Mr. Ernest James",male,19.00,0,0,S.P. 3464,8.1583,NaN,S
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.00,4,2,3101281,7.9250,NaN,S
69,70,0,3,"Kink, Mr. Vincenz",male,26.00,2,0,315151,8.6625,NaN,S
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.00,0,0,C.A. 33111,10.5000,NaN,S
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.00,5,2,CA 2144,46.9000,NaN,S
72,73,0,2,"Hood, Mr. Ambrose Jr",male,21.00,0,0,S.O.C. 14879,73.5000,NaN,S
73,74,0,3,"Chronopoulos, Mr. Apostolos",male,26.00,1,0,2680,14.4542,NaN,C
74,75,1,3,"Bing, Mr. Lee",male,32.00,0,0,1601,56.4958,NaN,S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.00,0,0,348123,7.6500,F G73,S
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
79,80,1,3,"Dowdell, Miss. Elizabeth",female,30.00,0,0,364516,12.4750,NaN,S
80,81,0,3,"Waelens, Mr. Achille",male,22.00,0,0,345767,9.0000,NaN,S
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.00,0,0,345779,9.5000,NaN,S
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
83,84,0,1,"Carrau, Mr. Francisco M",male,28.00,0,0,113059,47.1000,NaN,S
84,85,1,2,"Ilett, Miss. Bertha",female,17.00,0,0,SO/C 14885,10.5000,NaN,S
85,86,1,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",female,33.00,3,0,3101278,15.8500,NaN,S
86,87,0,3,"Ford, Mr. William Neal",male,16.00,1,3,W./C. 6608,34.3750,NaN,S
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,SOTON/OQ 392086,8.0500,NaN,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.00,3,2,19950,263.0000,C23 C25 C27,S
89,90,0,3,"Celotti, Mr. Francesco",male,24.00,0,0,343275,8.0500,NaN,S
90,91,0,3,"Christmann, Mr. Emil",male,29.00,0,0,343276,8.0500,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.00,0,0,347466,7.8542,NaN,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.00,1,0,W.E.P. 5734,61.1750,E31,S
93,94,0,3,"Dean, Mr. Bertram Frank",male,26.00,1,2,C.A. 2315,20.5750,NaN,S
94,95,0,3,"Coxon, Mr. Daniel",male,59.00,0,0,364500,7.2500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.00,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.00,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.00,1,0,244367,26.0000,NaN,S

In [11]:
input_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
input_test = pd.read_csv('Data/test.csv')
input_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

**1. Exploratory Data Analysis**

Work out which variables are numeric or strings, and which are categorical or continuous

In [13]:
# Count number of unique values
input_uniqvals = pd.DataFrame(input_train.nunique(axis=0),columns=["Unique Values"])
input_uniqvals

             Unique Values
PassengerId            891
Survived                 2
Pclass                   3
Name                   891
Sex                      2
Age                     88
SibSp                    7
Parch                    7
Ticket                 681
Fare                   248
Cabin                  147
Embarked                 3

In [14]:
input_train.value_counts()

PassengerId  Survived  Pclass  Name                                                                                Sex     Age    SibSp  Parch  Ticket             Fare      Cabin            Embarked
2            1         1       Cumings, Mrs. John Bradley (Florence Briggs Thayer)                                 female  38.00  1      0      PC 17599           71.2833   C85              C           1
572          1         1       Appleton, Mrs. Edward Dale (Charlotte Lamson)                                       female  53.00  2      0      11769              51.4792   C101             S           1
578          1         1       Silvey, Mrs. William Baird (Alice Munger)                                           female  39.00  1      0      13507              55.9000   E44              S           1
582          1         1       Thayer, Mrs. John Borland (Marian Longstreth Morris)                                female  39.00  1      1      17421              110.8833  C68              C           1
584          0         1       Ross, Mr. John Hugo                                                                 male    36.00  0      0      13049              40.1250   A10              C           1
586          1         1       Taussig, Miss. Ruth                                                                 female  18.00  0      2      110413             79.6500   E68              S           1
588          1         1       Frolicher-Stehli, Mr. Maxmillian                                                    male    60.00  1      1      13567              79.2000   B41              C           1
592          1         1       Stephenson, Mrs. Walter Bertram (Martha Eustis)                                     female  52.00  1      0      36947              78.2667   D20              C           1
600          1         1       Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")                                        male    49.00  1      0      PC 17485           56.9292   A20              C           1
610          1         1       Shutes, Miss. Elizabeth W                                                           female  40.00  0      0      PC 17582           153.4625  C125             S           1
619          1         2       Becker, Miss. Marion Louise                                                         female  4.00   2      1      230136             39.0000   F4               S           1
622          1         1       Kimball, Mr. Edwin Nelson Jr                                                        male    42.00  1      0      11753              52.5542   D19              S           1
626          0         1       Sutton, Mr. Frederick                                                               male    61.00  0      0      36963              32.3208   D50              S           1
628          1         1       Longley, Miss. Gretchen Fiske                                                       female  21.00  0      0      13502              77.9583   D9               S           1
631          1         1       Barkworth, Mr. Algernon Henry Wilson                                                male    80.00  0      0      27042              30.0000   A23              S           1
633          1         1       Stahelin-Maeglin, Dr. Max                                                           male    32.00  0      0      13214              30.5000   B50              C           1
642          1         1       Sagesser, Mlle. Emma                                                                female  24.00  0      0      PC 17477           69.3000   B35              C           1
646          1         1       Harper, Mr. Henry Sleeper                                                           male    48.00  1      0      PC 17572           76.7292   D33              C           1
648          1         1       Simonius-Blumer, Col. Oberst Alfons                                                 male    56.00  0      0      13213              35.5000   A26              C           1
660          0         1       Newell, Mr. Arthur Webster                                                          male    58.00  0      2      35273              113.2750  D48              C           1
663          0         1       Colley, Mr. Edward Pomeroy                                                          male    47.00  0      0      5727               25.5875   E58              S           1
573          1         1       Flynn, Mr. John Irwin ("Irving")                                                    male    36.00  0      0      PC 17474           26.3875   E25              S           1
559          1         1       Taussig, Mrs. Emil (Tillie Mandelbaum)                                              female  39.00  1      1      110413             79.6500   E67              S           1
680          1         1       Cardeza, Mr. Thomas Drake Martinez                                                  male    36.00  0      1      PC 17755           512.3292  B51 B53 B55      C           1
557          1         1       Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")                   female  48.00  1      0      11755              39.6000   A16              C           1
474          1         2       Jerwan, Mrs. Amin S (Marie Marthe Thuillard)                                        female  23.00  0      0      SC/AH Basle 541    13.7917   D                C           1
485          1         1       Bishop, Mr. Dickinson H                                                             male    25.00  1      0      11967              91.0792   B49              C           1
487          1         1       Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)                                     female  35.00  1      0      19943              90.0000   C93              S           1
488          0         1       Kent, Mr. Edward Austin                                                             male    58.00  0      0      11771              29.7000   B37              C           1
493          0         1       Molson, Mr. Harry Markland                                                          male    55.00  0      0      113787             30.5000   C30              S           1
497          1         1       Eustis, Miss. Elizabeth Mussey                                                      female  54.00  1      0      36947              78.2667   D20              C           1
499          0         1       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)                                     female  25.00  1      2      113781             151.5500  C22 C26          S           1
505          1         1       Maioni, Miss. Roberta                                                               female  16.00  0      0      110152             86.5000   B79              S           1
506          0         1       Penasco y Castellana, Mr. Victor de Satode                                          male    18.00  1      0      PC 17758           108.9000  C65              C           1
513          1         1       McGough, Mr. James Robert                                                           male    36.00  0      0      PC 17473           26.2875   E25              S           1
516          0         1       Walker, Mr. William Anderson                                                        male    47.00  0      0      36967              34.0208   D46              S           1
517          1         2       Lemore, Mrs. (Amelia Milley)                                                        female  34.00  0      0      C.A. 34260         10.5000   F33              S           1
521          1         1       Perreault, Miss. Anne                                                               female  30.00  0      0      12749              93.5000   B73              S           1
524          1         1       Hippach, Mrs. Louis Albert (Ida Sophia Fischer)                                     female  44.00  0      1      111361             57.9792   B18              C           1
537          0         1       Butt, Major. Archibald Willingham                                                   male    45.00  0      0      113050             26.5500   B38              S           1
540          1         1       Frolicher, Miss. Hedwig Margaritha                                                  female  22.00  0      2      13568              49.5000   B39              C           1
541          1         1       Crosby, Miss. Harriet R                                                             female  36.00  0      2      WE/P 5735          71.0000   B22              S           1
545          0         1       Douglas, Mr. Walter Donald                                                          male    50.00  1      0      PC 17761           106.4250  C86              C           1
551          1         1       Thayer, Mr. John Borland Jr                                                         male    17.00  0      2      17421              110.8833  C70              C           1
672          0         1       Davidson, Mr. Thornton                                                              male    31.00  1      0      F.C. 12750         52.0000   B71              S           1
682          1         1       Hassab, Mr. Hammad                                                                  male    27.00  0      0      PC 17572           76.7292   D49              C           1
461          1         1       Anderson, Mr. Harry                                                                 male    48.00  0      0      19952              26.5500   E12              S           1
766          1         1       Hogeboom, Mrs. John C (Anna Andrews)                                                female  51.00  1      0      13502              77.9583   D11              S           1
780          1         1       Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)                               female  43.00  0      1      24160              211.3375  B3               S           1
782          1         1       Dick, Mrs. Albert Adrian (Vera Gillespie)                                           female  17.00  1      0      17474              57.0000   B20              S           1
783          0         1       Long, Mr. Milton Clyde                                                              male    29.00  0      0      113501             30.0000   D6               S           1
790          0         1       Guggenheim, Mr. Benjamin                                                            male    46.00  0      0      PC 17593           79.2000   B82 B84          C           1
797          1         1       Leader, Dr. Alice (Farnham)                                                         female  49.00  0      0      17465              25.9292   D17              S           1
803          1         1       Carter, Master. William Thornton II                                                 male    11.00  1      2      113760             120.0000  B96 B98          S           1
807          0         1       Andrews, Mr. Thomas Jr                                                              male    39.00  0      0      112050             0.0000    A36              S           1
810          1         1       Chambers, Mrs. Norman Campbell (Bertha Griggs)                                      female  33.00  1      0      113806             53.1000   E8               S           1
821          1         1       Hays, Mrs. Charles Melville (Clara Jennings Gregg)                                  female  52.00  1      1      12749              93.5000   B69              S           1
824          1         3       Moor, Mrs. (Beila)                                                                  female  27.00  0      1      392096             12.4750   E121             S           1
836          1         1       Compton, Miss. Sara Rebecca                                                         female  39.00  1      1      PC 17756           83.1583   E49              C           1
854          1         1       Lines, Miss. Mary Conover                                                           female  16.00  0      1      PC 17592           39.4000   D28              S           1
858          1         1       Daly, Mr. Peter Denis                                                               male    51.00  0      0      113055             26.5500   E17              S           1
863          1         1       Swift, Mrs. Frederick Joel (Margaret Welles Barron)                                 female  48.00  0      0      17466              25.9292   D17              S           1
868          0         1       Roebling, Mr. Washington Augustus II                                                male    31.00  0      0      PC 17590           50.4958   A24              S           1
872          1         1       Beckwith, Mrs. Richard Leonard (Sallie Monypeny)                                    female  47.00  1      1      11751              52.5542   D35              S           1
873          0         1       Carlsson, Mr. Frans Olof                                                            male    33.00  0      0      695                5.0000    B51 B53 B55      S           1
880          1         1       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)                                       female  56.00  0      1      11767              83.1583   C50              C           1
888          1         1       Graham, Miss. Margaret Edith                                                        female  19.00  0      0      112053             30.0000   B42              S           1
773          0         2       Mack, Mrs. (Mary)                                                                   female  57.00  0      0      S.O./P.P. 3        10.5000   E77              S           1
764          1         1       Carter, Mrs. William Ernest (Lucile Polk)                                           female  36.00  1      2      113760             120.0000  B96 B98          S           1
690          1         1       Madill, Miss. Georgette Alexandra                                                   female  15.00  0      1      24160              211.3375  B5               S           1
760          1         1       Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)                            female  33.00  0      0      110152             86.5000   B77              S           1
691          1         1       Dick, Mr. Albert Adrian                                                             male    31.00  1      0      17474              57.0000   B20              S           1
699          0         1       Thayer, Mr. John Borland                                                            male    49.00  1      1      17421              110.8833  C68              C           1
700          0         3       Humblen, Mr. Adolf Mathias Nicolai Olsen                                            male    42.00  0      0      348121             7.6500    F G63            S           1
701          1         1       Astor, Mrs. John Jacob (Madeleine Talmadge Force)                                   female  18.00  1      0      PC 17757           227.5250  C62 C64          C           1
702          1         1       Silverthorne, Mr. Spencer Victor                                                    male    35.00  0      0      PC 17475           26.2875   E24              S           1
708          1         1       Calderhead, Mr. Edward Pennington                                                   male    42.00  0      0      PC 17476           26.2875   E24              S           1
711          1         1       Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")                                    female  24.00  0      0      PC 17482           49.5042   C90              C           1
713          1         1       Taylor, Mr. Elmer Zebley                                                            male    48.00  1      0      19996              52.0000   C126             S           1
716          0         3       Soholt, Mr. Peter Andreas Lauritz Andersen                                          male    19.00  0      0      348124             7.6500    F G73            S           1
717          1         1       Endres, Miss. Caroline Louise                                                       female  38.00  0      0      PC 17757           227.5250  C45              C           1
718          1         2       Troutt, Miss. Edwina Celia "Winnie"                                                 female  27.00  0      0      34218              10.5000   E101             S           1
725          1         1       Chambers, Mr. Norman Campbell                                                       male    27.00  1      0      113806             53.1000   E8               S           1
731          1         1       Allen, Miss. Elisabeth Walton                                                       female  29.00  0      0      24160              211.3375  B5               S           1
738          1         1       Lesurer, Mr. Gustave J                                                              male    35.00  0      0      PC 17755           512.3292  B101             C           1
742          0         1       Cavendish, Mr. Tyrell William                                                       male    36.00  1      0      19877              78.8500   C46              S           1
743          1         1       Ryerson, Miss. Susan Parker "Suzette"                                               female  21.00  2      2      PC 17608           262.3750  B57 B59 B63 B66  C           1
746          0         1       Crosby, Capt. Edward Gifford                                                        male    70.00  1      1      WE/P 5735          71.0000   B22              S           1
749          0         1       Marvin, Mr. Daniel Warner                                                           male    19.00  1      0      113773             53.1000   D30              S           1
752          1         3       Moor, Master. Meier                                                                 male    6.00   0      1      392096             12.4750   E121             S           1
463          0         1       Gee, Mr. Arthur H                                                                   male    47.00  0      0      111320             38.5000   E63              S           1
457          0         1       Millet, Mr. Francis Davis                                                           male    65.00  0      0      13509              26.5500   E38              S           1
4            1         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)                                        female  35.00  1      0      113803             53.1000   C123             S           1
138          0         1       Futrelle, Mr. Jacques Heath                                                         male    37.00  1      0      113803             53.1000   C123             S           1
149          0         2       Navratil, Mr. Michel ("Louis M Hoffman")                                            male    36.50  0      2      230080             26.0000   F2               S           1
152          1         1       Pears, Mrs. Thomas (Edith Wearne)                                                   female  22.00  1      0      113776             66.6000   C2               S           1
171          0         1       Van der hoef, Mr. Wyckoff                                                           male    61.00  0      0      111240             33.5000   B19              S           1

In [15]:
# Get the data types of each column
input_dtypes = pd.DataFrame(input_train.dtypes, columns=["Data Type"])
input_dtypes

            Data Type
PassengerId     int64
Survived        int64
Pclass          int64
Name           object
Sex            object
Age           float64
SibSp           int64
Parch           int64
Ticket         object
Fare          float64
Cabin          object
Embarked       object

In [16]:
# Merge to create one dataframe
pd.merge(left=input_uniqvals,right=input_dtypes,left_index=True,right_index=True)

             Unique Values Data Type
PassengerId            891     int64
Survived                 2     int64
Pclass                   3     int64
Name                   891    object
Sex                      2    object
Age                     88   float64
SibSp                    7     int64
Parch                    7     int64
Ticket                 681    object
Fare                   248   float64
Cabin                  147    object
Embarked                 3    object

In [158]:
input_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
# input_train["Ticket"]
input_train["BookedCabin"] = input_train["Cabin"].notnull().astype('int')
input_train.head(50)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,BookedCabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,0
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,1
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,0
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,0
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,0
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,0
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,0
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,0
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,0
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,1
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q,0
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,1
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,0
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,0
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,1
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,0
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S,0
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,0
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C,1
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q,0
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S,0
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C,0
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S,0
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C,0
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S,0
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S,0
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,0
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S,0
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S,0
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C,0
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C,0
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,330958,7.8792,NaN,Q,0
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S,0
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q,0
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q,0
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C,0
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S,0

In [32]:
# We know that survived is the dependent variable
dep_vars = ['Survived']
# Assume that Name, Ticket, and cabin are non-continous and/or no effect on outcome
indep_vars = ['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','BookedCabin']
# Continuous variables
cont_vars = ['Age','Fare']

In [33]:
dep_vars + indep_vars

['Survived',
 'Pclass',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Fare',
 'Embarked',
 'BookedCabin']

Process data

In [35]:
# Filter for columns we want
build_train = input_train[dep_vars+indep_vars]
#build_test = input_test[['PassengerId']+indep_vars]
build_train.head(30)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,BookedCabin
0,0,3,male,22.0,1,0,7.2500,S,0
1,1,1,female,38.0,1,0,71.2833,C,1
2,1,3,female,26.0,0,0,7.9250,S,0
3,1,1,female,35.0,1,0,53.1000,S,1
4,0,3,male,35.0,0,0,8.0500,S,0
5,0,3,male,NaN,0,0,8.4583,Q,0
6,0,1,male,54.0,0,0,51.8625,S,1
7,0,3,male,2.0,3,1,21.0750,S,0
8,1,3,female,27.0,0,2,11.1333,S,0
9,1,2,female,14.0,1,0,30.0708,C,0
10,1,3,female,4.0,1,1,16.7000,S,1
11,1,1,female,58.0,0,0,26.5500,S,1
12,0,3,male,20.0,0,0,8.0500,S,0
13,0,3,male,39.0,1,5,31.2750,S,0
14,0,3,female,14.0,0,0,7.8542,S,0
15,1,2,female,55.0,0,0,16.0000,S,0
16,0,3,male,2.0,4,1,29.1250,Q,0
17,1,2,male,NaN,0,0,13.0000,S,0
18,0,3,female,31.0,1,0,18.0000,S,0
19,1,3,female,NaN,0,0,7.2250,C,0
20,0,2,male,35.0,0,0,26.0000,S,0
21,1,2,male,34.0,0,0,13.0000,S,1
22,1,3,female,15.0,0,0,8.0292,Q,0
23,1,1,male,28.0,0,0,35.5000,S,1
24,0,3,female,8.0,3,1,21.0750,S,0
25,1,3,female,38.0,1,5,31.3875,S,0
26,0,3,male,NaN,0,0,7.2250,C,0
27,0,1,male,19.0,3,2,263.0000,S,1
28,1,3,female,NaN,0,0,7.8792,Q,0
29,0,3,male,NaN,0,0,7.8958,S,0

In [36]:
# Mappings for categorical
sex_map = {'male':0,'female':1}

In [38]:
# Loop through each dataset and process variables
# for df in [build_train,build_test]:
for df in [build_train]:
    
    # Calculate Quartiles
    age_qs = pd.qcut(df['Age'],q=4, labels=[1,2,3,4]).copy()
    fare_qs = pd.qcut(df['Fare'],q=4, labels=[1,2,3,4]).copy()

    # Band continuous variables using quantiles
    df['Age_Quartile'] = age_qs
    df['Fare_Quartile'] = fare_qs
    df['Sex'] = df['Sex'].map(sex_map)

In [39]:
build_train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,BookedCabin,Age_Quartile,Fare_Quartile
0,0,3,0,22.0,1,0,7.2500,S,0,2,1
1,1,1,1,38.0,1,0,71.2833,C,1,3,4
2,1,3,1,26.0,0,0,7.9250,S,0,2,2
3,1,1,1,35.0,1,0,53.1000,S,1,3,4
4,0,3,0,35.0,0,0,8.0500,S,0,3,2

In [42]:
build_train['fare_band'] = pd.qcut(build_train["Fare"],
                                    q=20,
                                    precision=2).copy()

# apply value_counts which is the same as group by + count
char_table=build_train.groupby(['fare_band'])['Survived'].mean('Survived').sort_index()

char_table

fare_band
(-0.01, 7.22]       0.109091
(7.22, 7.55]        0.189189
(7.55, 7.75]        0.333333
(7.75, 7.85]        0.256410
(7.85, 7.91]        0.113636
(7.91, 8.05]        0.225806
(8.05, 9.0]         0.142857
(9.0, 10.5]         0.280000
(10.5, 13.0]        0.461538
(13.0, 14.45]       0.315789
(14.45, 16.1]       0.382979
(16.1, 21.68]       0.463415
(21.68, 26.0]       0.459016
(26.0, 27.0]        0.642857
(27.0, 31.0]        0.400000
(31.0, 39.69]       0.347826
(39.69, 56.5]       0.510638
(56.5, 77.96]       0.547619
(77.96, 112.08]     0.761905
(112.08, 512.33]    0.755556
Name: Survived, dtype: float64

In [70]:
build_train.groupby("fare_band")["Survived"].agg(['count', 'mean','sem'])

            count      mean       sem
fare_band
(0, 10]       321  0.205607  0.022592
(10, 25]      221  0.420814  0.033285
(25, 1000]    334  0.544910  0.027289

In [44]:
build_train['fare_band'] = pd.cut(build_train["Fare"],
                                    bins=[0,10,25,1000],
                                    precision=2)

build_train['fare_band'].value_counts().sort_index()

fare_band
(0, 10]       321
(10, 25]      221
(25, 1000]    334
Name: count, dtype: int64

In [69]:
build_train.groupby("fare_band")["Survived"].agg(['count', 'mean','sem'])

            count      mean       sem
fare_band
(0, 10]       321  0.205607  0.022592
(10, 25]      221  0.420814  0.033285
(25, 1000]    334  0.544910  0.027289

In [71]:
build_train.head(25)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,BookedCabin,Age_Quartile,Fare_Quartile,fare_band,ParchBin
0,0,3,0,22.0,1,0,7.2500,S,0,2,1,"(0, 10]",0
1,1,1,1,38.0,1,0,71.2833,C,1,3,4,"(25, 1000]",0
2,1,3,1,26.0,0,0,7.9250,S,0,2,2,"(0, 10]",0
3,1,1,1,35.0,1,0,53.1000,S,1,3,4,"(25, 1000]",0
4,0,3,0,35.0,0,0,8.0500,S,0,3,2,"(0, 10]",0
5,0,3,0,NaN,0,0,8.4583,Q,0,NaN,2,"(0, 10]",0
6,0,1,0,54.0,0,0,51.8625,S,1,4,4,"(25, 1000]",0
7,0,3,0,2.0,3,1,21.0750,S,0,1,3,"(10, 25]",1
8,1,3,1,27.0,0,2,11.1333,S,0,2,2,"(10, 25]",1
9,1,2,1,14.0,1,0,30.0708,C,0,1,3,"(25, 1000]",0
10,1,3,1,4.0,1,1,16.7000,S,1,1,3,"(10, 25]",1
11,1,1,1,58.0,0,0,26.5500,S,1,4,3,"(25, 1000]",0
12,0,3,0,20.0,0,0,8.0500,S,0,1,2,"(0, 10]",0
13,0,3,0,39.0,1,5,31.2750,S,0,4,4,"(25, 1000]",1
14,0,3,1,14.0,0,0,7.8542,S,0,1,1,"(0, 10]",0
15,1,2,1,55.0,0,0,16.0000,S,0,4,3,"(10, 25]",0
16,0,3,0,2.0,4,1,29.1250,Q,0,1,3,"(25, 1000]",1
17,1,2,0,NaN,0,0,13.0000,S,0,NaN,2,"(10, 25]",0
18,0,3,1,31.0,1,0,18.0000,S,0,3,3,"(10, 25]",0
19,1,3,1,NaN,0,0,7.2250,C,0,NaN,1,"(0, 10]",0
20,0,2,0,35.0,0,0,26.0000,S,0,3,3,"(25, 1000]",0
21,1,2,0,34.0,0,0,13.0000,S,1,3,2,"(10, 25]",0
22,1,3,1,15.0,0,0,8.0292,Q,0,1,2,"(0, 10]",0
23,1,1,0,28.0,0,0,35.5000,S,1,2,4,"(25, 1000]",0
24,0,3,1,8.0,3,1,21.0750,S,0,1,3,"(10, 25]",1

In [68]:
build_train.groupby("Embarked")["Survived"].agg(['count', 'mean','sem'])

          count      mean       sem
Embarked
C           168  0.553571  0.038468
Q            77  0.389610  0.055939
S           644  0.336957  0.018640

In [67]:
build_train.groupby("BookedCabin")["Survived"].agg(['count', 'mean','sem'])

             count      mean       sem
BookedCabin
0              687  0.299854  0.017494
1              204  0.666667  0.033086

In [79]:

build_train.groupby("Parch")["Survived"].agg(['count', 'mean'])
build_train["ParchBin"]=np.where((build_train.Parch>0),1,0)
build_train.groupby("ParchBin")["Survived"].agg(['count', 'mean'])
#build_train.head(100)

          count      mean
ParchBin
0           678  0.343658
1           213  0.511737

In [64]:
build_train.groupby("SibSp")["Survived"].agg(['count', 'mean','sem'])

       count      mean       sem
SibSp
0        608  0.345395  0.019300
1        209  0.535885  0.034579
2         28  0.464286  0.095979
3         16  0.250000  0.111803
4         18  0.166667  0.090388
5          5  0.000000  0.000000
8          7  0.000000  0.000000

In [76]:
build_train['Age_band'] = pd.qcut(build_train["Age"],
                                    q=10,
                                    precision=2).copy()

# apply value_counts which is the same as group by + count
char_table=build_train.groupby(['Age_band'])['Survived'].mean('Survived').sort_index()

In [77]:
build_train.groupby("Age_band")["Survived"].agg(['count', 'mean','sem'])

              count      mean       sem
Age_band
(0.41, 14.0]     77  0.584416  0.056531
(14.0, 19.0]     87  0.390805  0.052615
(19.0, 22.0]     67  0.283582  0.055482
(22.0, 25.0]     70  0.371429  0.058169
(25.0, 28.0]     61  0.393443  0.063067
(28.0, 31.8]     66  0.393939  0.060606
(31.8, 36.0]     91  0.483516  0.052676
(36.0, 41.0]     53  0.358491  0.066503
(41.0, 50.0]     78  0.397436  0.055769
(50.0, 80.0]     64  0.343750  0.059839

In [48]:
#Function to create a logistic regression model using one numeric variable and the dependent variable
def build_toy_model(dependent, independent):
    toy_model_train = build_train[dependent+independent].copy()

    toy_model_train.dropna(inplace=True)
    toy_model_train['Int'] = 1
    log_reg = sm.Logit(toy_model_train[dependent],toy_model_train[independent+['Int']]).fit()
    return log_reg

In [49]:
age_q_model = build_toy_model(dep_vars, ['Age_Quartile'])
sex_model = build_toy_model(dep_vars, ['Sex'])
pclass_model = build_toy_model(dep_vars, ['Pclass'])

Optimization terminated successfully.
         Current function value: 0.674580
         Iterations 4
Optimization terminated successfully.
         Current function value: 0.515041
         Iterations 5
Optimization terminated successfully.
         Current function value: 0.608531
         Iterations 5

In [50]:
age_sex_model = build_toy_model(dep_vars, ['Age_Quartile','Sex'])

Optimization terminated successfully.
         Current function value: 0.525659
         Iterations 5

In [51]:
print(age_q_model.summary())
print(sex_model.summary())
print(pclass_model.summary())

                           Logit Regression Results
==============================================================================
Dep. Variable:               Survived   No. Observations:                  714
Model:                          Logit   Df Residuals:                      712
Method:                           MLE   Df Model:                            1
Date:                Fri, 10 May 2024   Pseudo R-squ.:                0.001261
Time:                        11:27:08   Log-Likelihood:                -481.65
converged:                       True   LL-Null:                       -482.26
Covariance Type:            nonrobust   LLR p-value:                    0.2701
================================================================================
                   coef    std err          z      P>|z|      [0.025      0.975]
--------------------------------------------------------------------------------
Age_Quartile    -0.0753      0.068     -1.102      0.270      -0.209       0.059
Int             -0.1930      0.185     -1.041      0.298      -0.556       0.170
================================================================================
                           Logit Regression Results
==============================================================================
Dep. Variable:               Survived   No. Observations:                  891
Model:                          Logit   Df Residuals:                      889
Method:                           MLE   Df Model:                            1
Date:                Fri, 10 May 2024   Pseudo R-squ.:                  0.2266
Time:                        11:27:08   Log-Likelihood:                -458.90
converged:                       True   LL-Null:                       -593.33
Covariance Type:            nonrobust   LLR p-value:                 2.020e-60
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Sex            2.5137      0.167     15.036      0.000       2.186       2.841
Int           -1.4571      0.106    -13.701      0.000      -1.666      -1.249
==============================================================================
                           Logit Regression Results
==============================================================================
Dep. Variable:               Survived   No. Observations:                  891
Model:                          Logit   Df Residuals:                      889
Method:                           MLE   Df Model:                            1
Date:                Fri, 10 May 2024   Pseudo R-squ.:                 0.08617
Time:                        11:27:08   Log-Likelihood:                -542.20
converged:                       True   LL-Null:                       -593.33
Covariance Type:            nonrobust   LLR p-value:                 4.885e-24
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Pclass        -0.8501      0.087     -9.755      0.000      -1.021      -0.679
Int            1.4468      0.207      6.975      0.000       1.040       1.853
==============================================================================

In [52]:
print(age_sex_model.summary())

                           Logit Regression Results
==============================================================================
Dep. Variable:               Survived   No. Observations:                  714
Model:                          Logit   Df Residuals:                      711
Method:                           MLE   Df Model:                            2
Date:                Fri, 10 May 2024   Pseudo R-squ.:                  0.2217
Time:                        11:27:08   Log-Likelihood:                -375.32
converged:                       True   LL-Null:                       -482.26
Covariance Type:            nonrobust   LLR p-value:                 3.611e-47
================================================================================
                   coef    std err          z      P>|z|      [0.025      0.975]
--------------------------------------------------------------------------------
Age_Quartile    -0.0197      0.081     -0.243      0.808      -0.179       0.139
Sex              2.4752      0.185     13.360      0.000       2.112       2.838
Int             -1.3035      0.236     -5.530      0.000      -1.765      -0.842
================================================================================

In [53]:
#Function to create a logistic regression model using one numeric variable and the dependent variable
def predict_toy_model(independent, model_name):
    toy_model_train = build_test[independent].copy()

    toy_model_train.dropna(inplace=True)
    toy_model_train['Int'] = 1
    predictions = model_name.predict(toy_model_train)
    predictions.name = 'SurvivalProb'
    return predictions

In [54]:
age_q_predictions = predict_toy_model(['Age_Quartile'],age_q_model)
sex_predictions = predict_toy_model(['Sex'],sex_model)
pclass_predictions = predict_toy_model(['Pclass'],pclass_model)

In [55]:
test_results = pd.DataFrame(build_test[['PassengerId','Sex']])
test_results['PredProb'] = sex_predictions
test_results['Survived'] = test_results['PredProb'].round().astype(int)

In [56]:
test_results.dtypes

PassengerId      int64
Sex              int64
PredProb       float64
Survived         int32
dtype: object

In [57]:
final_result = test_results.drop(columns=['PredProb'],errors='ignore')
final_result.to_csv('Outputs/simple_logit.csv',index=False)

OSError: Cannot save file into a non-existent directory: 'Outputs'

## Second attempt with Sex and Pclass

In [ ]:
toy_model_train = build_train[['Survived','Pclass','Sex']].copy()

toy_model_train.dropna(inplace=True)
toy_model_train['Int'] = 1
model_2 = sm.Logit(toy_model_train['Survived'],toy_model_train[['Pclass','Sex','Int']]).fit()
model_2.summary()

Optimization terminated successfully.
         Current function value: 0.464195
         Iterations 6

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:               Survived   No. Observations:                  891
Model:                          Logit   Df Residuals:                      888
Method:                           MLE   Df Model:                            2
Date:                Thu, 09 May 2024   Pseudo R-squ.:                  0.3029
Time:                        17:42:02   Log-Likelihood:                -413.60
converged:                       True   LL-Null:                       -593.33
Covariance Type:            nonrobust   LLR p-value:                 8.798e-79
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Pclass        -0.9606      0.106     -9.057      0.000      -1.168      -0.753
Sex            2.6434      0.184     14.380      0.000       2.283       3.004
Int            0.6512      0.241      2.703      0.007       0.179       1.124
==============================================================================
"""

In [ ]:
model_2_predictions = predict_toy_model(['Pclass','Sex'],model_2)

In [ ]:
test_results2 = pd.DataFrame(build_test[['PassengerId','Sex']])
test_results2['PredProb'] = model_2_predictions
test_results2['Survived'] = test_results2['PredProb'].round()

In [ ]:
final_result2 = test_results2.drop(columns=['PredProb','Sex'],errors='ignore')
final_result2.to_csv('Outputs/sex_pclass_logit.csv',index=False)